cpp/gsoap/vector/test/messg.test1.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns1="http://tempuri.org/ns1.xsd"
  xmlns:ns="urn:messg">
 <SOAP-ENV:Body>
  <ns:test1>
   <param-1>0</param-1>
   <param-2></param-2>
  </ns:test1>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
